Show / Hide Table of Contents
Class RebarPatternBase
Represents a base class for Rebar Pattern
Inheritance
System.Object
OpenObject
OpenElementId
RebarPatternBase
RebarStirrupPattern
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class RebarPatternBase : OpenElementId
Properties
Improve this Doc   View Source
EndPosition
This defines end position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
Declaration
public double EndPosition { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Relative
Mode of defining the position of the pattern false is for absolute length (position) of the pattern (default) true is for relative length (position) of the pattern in range [0 1]
Declaration
public bool Relative { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
StartPosition
This defines begin position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
Declaration
public double StartPosition { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source